app/controllers/events_controller.rb

  def index;
    @events = Event.all
    @venues = Venue.all
---
SELECT * FROM `events`
SELECT * FROM `venues`

  def show
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 2)

  def create
    @event = Event.new(params[:event])
    if @event.save
---
INSERT INTO `events` (`name`, `created_at`, `tickets_released`, `availability_end`, `updated_at`, `venue_id`, `text`, `introduction`, `availability_start`) VALUES('Build 2010', '2010-03-30 16:55:07', 0, '2010-11-10', '2010-03-30 16:55:07', 2, 'Longer formatted text', 'Short unformatted text', '2010-07-10')