app/controllers/purchase_items_controller.rb

  def create
    @ticket = Ticket.find(params[:ticket_id])
    @purchase_item = PurchaseItem.create!(:cart => current_cart, :ticket => @ticket, :quantity => 1, :unit_price => @ticket.price_pounds)
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 6)
INSERT INTO `carts` (`purchase_state`, `created_at`, `updated_at`, `delivery_name`, `delivery_postcode`, `delivery_instructions`, `user_id`, `purchased_at`, `delivery_address1`, `delivery_address2`) VALUES(NULL, '2010-03-31 11:28:38', '2010-03-31 11:28:38', NULL, NULL, NULL, NULL, NULL, NULL, NULL)
INSERT INTO `purchase_items` (`created_at`, `product_id`, `quantity`, `updated_at`, `unit_price`, `cart_id`) VALUES('2010-03-31 11:28:38', NULL, 1, '2010-03-31 11:28:38', 0, 1)