app/controllers/tickets_controller.rb

  def index;
    @event = Event.find_by_id(params[:event_id])
    if @event
      @tickets = @event.tickets
    else
      @tickets = Ticket.all
---
SELECT * FROM `events` WHERE (`events`.`id` IS NULL) LIMIT 1
SELECT * FROM `tickets` WHERE (`tickets`.event_id = 1)

  def show
    @ticket = Ticket.find(params[:id])
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 1)

  def new
    @ticket = Ticket.new
    @ticket.event = Event.find(params[:event_id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 1)

  def create
    @ticket = Ticket.new(params[:ticket])
    if @ticket.save
---
INSERT INTO `tickets` (`ticket_name`, `event_id`, `availability_end`, `price_pounds`, `released`, `quantity_available`, `availability_start`) VALUES('Standard', NULL, '2010-11-10', 200, 0, 350, '2010-07-10')

  def purchase
    @ticket = Ticket.find(params[:ticket_id])
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 3)