app/controllers/venues_controller.rb

SELECT * FROM `venues` WHERE (`venues`.`id` = 1)
---
  def show
    @venue = Venue.find(params[:id])

INSERT INTO "venues" ("name", "address", "seated_capacity", "overflow_capacity", "google_maps_location", "venue_id", "text") VALUES('Belfast Waterfront Studio', '', 400, 100, '', 1, 'The Waterfront Studio is a performance and exhibition space seating 400 people used regularly for music, comedy, exhibition and .....')
---
  def create
    @venue = Venue.new(params[:venue])
    if @venue.save